In [3]:
import pandas as pd
import numpy as np
a=pd.read_csv("C:\\Users\\prash\\OneDrive\\Desktop\\Pandas\\CID,NAME,STATE,DSG.csv")
print(a)

    CID        NAME STATE DSG
0   100    VISHNAVI    TS  SE
1   200     MANJULA    AP  SE
2   300     BHUMIKA    TS  TL
3   400  LAXIMIDEVI  BANG  TL
4   500       SWATI    AP  PM
5   600     SHAKSHI  BANG  PM
6   700    BHARGAVI    TS  SE
7   800       UDAYA    AP  PM
8   900       SWETA  BANG  SE
9   750      ANJALI    AP  TL
10  650    JAYASREE  BANG  PM
11  550     SIRISHA    AP  HR
12  450     MADHAVI    TS  HR
13  350      AKHILA    AP  HR
14  150       RADHA  BANG  TL
15  950     MOUNIKA    AP  HR
16  125     FARHANA    TS  TL
17  185      JHANSI    AP  TL

In [15]:
#now we are grouping by state
s=a.groupby("STATE")
for groupname,groupby in s:
    print("group name:",groupname)
    print(groupby)

group name: AP
    CID     NAME STATE DSG
1   200  MANJULA    AP  SE
4   500    SWATI    AP  PM
7   800    UDAYA    AP  PM
9   750   ANJALI    AP  TL
11  550  SIRISHA    AP  HR
13  350   AKHILA    AP  HR
15  950  MOUNIKA    AP  HR
17  185   JHANSI    AP  TL
group name: BANG
    CID        NAME STATE DSG
3   400  LAXIMIDEVI  BANG  TL
5   600     SHAKSHI  BANG  PM
8   900       SWETA  BANG  SE
10  650    JAYASREE  BANG  PM
14  150       RADHA  BANG  TL
group name: TS
    CID      NAME STATE DSG
0   100  VISHNAVI    TS  SE
2   300   BHUMIKA    TS  TL
6   700  BHARGAVI    TS  SE
12  450   MADHAVI    TS  HR
16  125   FARHANA    TS  TL

In [17]:
    print("-"*50)
    print("no of groups:",s.ngroups)

--------------------------------------------------
no of groups 3

In [21]:
s=a.groupby('DSG')
print(s)#its give bytes data
for groupname,group in s:
    print("name of the group",groupname)
    print(group)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000243095EEF60>
name of the group HR
    CID     NAME STATE DSG
11  550  SIRISHA    AP  HR
12  450  MADHAVI    TS  HR
13  350   AKHILA    AP  HR
15  950  MOUNIKA    AP  HR
name of the group PM
    CID      NAME STATE DSG
4   500     SWATI    AP  PM
5   600   SHAKSHI  BANG  PM
7   800     UDAYA    AP  PM
10  650  JAYASREE  BANG  PM
name of the group SE
   CID      NAME STATE DSG
0  100  VISHNAVI    TS  SE
1  200   MANJULA    AP  SE
6  700  BHARGAVI    TS  SE
8  900     SWETA  BANG  SE
name of the group TL
    CID        NAME STATE DSG
2   300     BHUMIKA    TS  TL
3   400  LAXIMIDEVI  BANG  TL
9   750      ANJALI    AP  TL
14  150       RADHA  BANG  TL
16  125     FARHANA    TS  TL
17  185      JHANSI    AP  TL

In [23]:
s.count()

     CID  NAME  STATE
DSG
HR     4     4      4
PM     4     4      4
SE     4     4      4
TL     6     6      6

In [25]:
#size()
s.size()

DSG
HR    4
PM    4
SE    4
TL    6
dtype: int64

In [29]:
s.first()# we will get first values

     CID      NAME STATE
DSG
HR   550   SIRISHA    AP
PM   500     SWATI    AP
SE   100  VISHNAVI    TS
TL   300   BHUMIKA    TS

In [37]:
s.last()#its give last values

     CID      NAME STATE
DSG
HR   950   MOUNIKA    AP
PM   650  JAYASREE  BANG
SE   900     SWETA  BANG
TL   185    JHANSI    AP

In [53]:

s.get_group("TL")

    CID        NAME STATE DSG
2   300     BHUMIKA    TS  TL
3   400  LAXIMIDEVI  BANG  TL
9   750      ANJALI    AP  TL
14  150       RADHA  BANG  TL
16  125     FARHANA    TS  TL
17  185      JHANSI    AP  TL

In [ ]:
s.get_group("TL").group